#+PROPERTY: header-args :results verbatim :tangle bootstrap.el :session bootstrap :cache no

* bootstrap.el
  :PROPERTIES:
  :ID:       CCA0F433-C3BA-436B-B7BD-4852C70B8BCA
  :END:

  The tangled [[file:bootstrap.el]] is the one that will be sym-linked as
  =~/.emacs.d/init.el=. It's main job is to prepare the stage for
  [[file:init.el]] by providing pre-requisites so that the init script can
  properly continue the configuration of Emacs.
  

** Define Org environment variables

   These variables need to be in the =bootstrap= file, since they
   depend on the specific computer.
   
   #+begin_src elisp
     (defvar pgpb-gpg-keys (list "pgpb.padilla@gmail.com"))
     (defvar pgpb-org-dirs (list
                            "~/org/31e520d4df" ;; agenda files
                            "~/org/0f6de25076" ;; journal files
                            "~/org/2204c36fc7" ;; archive files
                            )) 
   #+end_src

  
** Load the generic init script: [[file:init.el]]

   #+begin_src elisp
     (load "~/dotfiles/emacs/init.el")
   #+end_src


** TODO Move to [[file:pgpb.org]]
   :PROPERTIES:
   :header-args: :tangle no
   :END:
   
   Load my personal [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Saving-Customizations.html][custom-file]]:

   #+begin_src bash :var file="emacs-custom.el"
     ls ~/.config/${file}
     ack -B 2 -A 2 "emacs-custom" ./*.el
   #+end_src

   #+RESULTS:
   : /Users/pgpb.padilla/.config/emacs-custom.el
   : ./pgpb.el-221-  ;; https://www.gnu.org/software/emacs/manual/html_node/emacs/Saving-Customizations.html
   : ./pgpb.el-222-
   : ./pgpb.el:223:  (setq custom-file "~/.config/emacs-custom.el")
   : ./pgpb.el-224-  ;; Purposely ignore all variables written to the =custom-file=
   : ./pgpb.el-225-  ;; (load custom-file)

   - [ ] Ignore the default =custom-file= (commented out):

     #+begin_src bash
       ack -B 2  "load custom-file" ./*.el
     #+end_src

     #+RESULTS:
     : ./pgpb.el-223-  (setq custom-file "~/.config/emacs-custom.el")
     : ./pgpb.el-224-  ;; Purposely ignore all variables written to the =custom-file=
     : ./pgpb.el:225:  ;; (load custom-file)

     This is because I want my settings to always be loaded from my
     =~/dotfiles= repo. 
